In [1]:
import pandas as pd

In [2]:
import numpy as np
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [4]:
df[df.a<7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [5]:
df[df.b>7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [10]:
df[df['c']>7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [8]:
df["c"] #df.c

n  v
d  1    10.0
   2    11.0
e  2    12.0
   3     NaN
   4    12.0
Name: c, dtype: float64

In [17]:
df[df.c >= 7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [42]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1), ('d',2), ('e',2), ('e',3)],
        names = ['n', 'v' ]))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [28]:
#중복된 값 row 제거, 아직 저장은 X
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [38]:
# df.drop_duplicates(inplace=True) #권장 X
df = df.drop_duplicates()
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

docs보는 법, drop_dupliacate()?

In [45]:
df.drop_duplicates(keep='first')
df.drop_duplicates(keep='last')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

4)Logic in Python(and Pandas) - and, or, not, xor, any, all연산 이해하기

In [46]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [47]:
df["a"]

n  v
d  1    4
   2    5
e  2    6
   3    6
Name: a, dtype: int64

In [48]:
df["a"] != 7

n  v
d  1    True
   2    True
e  2    True
   3    True
Name: a, dtype: bool

In [49]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: b, dtype: bool

In [60]:
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [64]:
df.a.isin([5])
#df["a"].isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
Name: a, dtype: bool

In [72]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, 9, 9, np.nan],
        "c" : [np.nan, 11, 12,12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1), ('d',2), ('e',2), ('e',3), ('e', 4)],
        names = ['n', 'v' ]))
df

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [73]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False   True
  2  False  False  False
e 2  False  False  False
  3  False  False  False
  4   True   True  False

In [76]:
df['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [77]:
df['a'].isnull().sum()

1

In [78]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True  False
  2   True   True   True
e 2   True   True   True
  3   True   True   True
  4  False  False   True

In [79]:
df.notnull()

         a      b      c
n v
d 1   True   True  False
  2   True   True   True
e 2   True   True   True
  3   True   True   True
  4  False  False   True

In [80]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [81]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [86]:
df

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [85]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [84]:
df[df.a.notnull()]

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0

* &, |, ~, ^, df.any(), df.all() 
* and, or, not, xor, any, all

In [93]:
df

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [95]:
df.any()

a    True
b    True
c    True
dtype: bool

In [96]:
df.all()

a    True
b    True
c    True
dtype: bool

In [99]:
df.a.notnull().any()

True

In [100]:
df.a.notnull().all()

False

In [103]:
~df.a.notnull().all()
#~는 boolean은 반대로

True

In [105]:
1 and 2

2

In [106]:
True and False

False

In [107]:
False and False

False

In [120]:
df[df.b==7] & df[df.a==5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

In [121]:
df[df.b==7]

       a    b   c
n v
d 1  4.0  7.0 NaN

In [122]:
df[df.a==5]

       a    b     c
n v
d 2  5.0  8.0  11.0

In [119]:
df[df.a==5] | df[df.b==7]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

Head, tail로 데이터 미리보기

In [124]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, 9, 9, np.nan],
        "c" : [np.nan, 11, 12,12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1), ('d',2), ('e',2), ('e',3), ('e', 4)],
        names = ['n', 'v' ]))
df

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [126]:
df.head() #기본값 5

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [127]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0

In [128]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [ ]:
#특정 비율로 데이터 샘플링, 랜덤하게

In [130]:
df.sample(frac=0.5)

       a    b     c
n v
d 1  4.0  7.0   NaN
e 2  6.0  9.0  12.0

In [131]:
df.sample(frac=0.7)

       a    b     c
n v
e 2  6.0  9.0  12.0
d 2  5.0  8.0  11.0
e 3  6.0  9.0  12.0
d 1  4.0  7.0   NaN

In [136]:
#절대수 샘플링
df.sample(n=2)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0  12.0

In [139]:
df

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [138]:
df.iloc[:2]

       a    b     c
n v
d 1  4.0  7.0   NaN
  2  5.0  8.0  11.0

In [140]:
df.iloc[3:]

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  NaN  12.0

In [142]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                    index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])

In [144]:
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [147]:
df.nlargest(3, 'GDP') #컬럼에서 큰거 3개

         population      GDP alpha-2
France     65000000  2583560      FR
Italy      59000000  1937894      IT
Iceland      337000    17036      IS

In [148]:
df.nlargest(3, 'alpha-2') #당연히 숫자에서만 쓸 수 있지

TypeError: Column 'alpha-2' has dtype object, cannot use method 'nlargest' with this dtype

In [150]:
df.nsmallest(1, 'GDP')

        population  GDP alpha-2
Tuvalu       11300   38      TV